Revit 2027 API
ParameterTypeId.CircularFramingDiameter Property
 "Circular Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CircularFramingDiameter { get; }
Public Shared ReadOnly Property CircularFramingDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CircularFramingDiameter {
	ForgeTypeId^ get ();
}
static member CircularFramingDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace